#1) რა არის ფუნქცია?

#ფუნქცია არის კოდის ბლოკი რომელსაც აქვს სახელი
#იღებს მონაცემებს და აბრუნებს შედეგს
#მისი პლიუსია რომ გვეხმარება კოდის გამეორების თავიდან აცილებაში და რაიმეს მოკლედ რა მარტივად ჩაწერაში.


#2) დაწერეთ ფუნქცია, რომელიც აბრუნებს "Even" თუ რიცხვი ლუწია, "Odd" თუ კენტია.
def even_or_odd(i):
    if i % 2 == 0:
        return "Even"
    else:
        return "Odd"

#3) ფუნქცია იღებს სიას რიცხვებისგან და აბრუნებს მხოლოდ დადებითების ჯამს.

def sum(numbers):
    total = 0
    for i in numbers:
        if i > 0:
            total += i
    return total

#4) ფუნქცია იღებს რიცხვს და თუ ის ლუწია, გაორმაგებს, წინააღმდეგ შემთხვევაში 3–ით გაიმრავლებს.

def number(i):
    if i % 2 == 0:
        return i * 2
    else:
        return i * 3

#5) ფუნქცია იღებს სტრინგს და აქრობს ბოლო სიმბოლოს, თუ ის "!" არის.

#6) ფუნქცია აბრუნებს სიაში დადებითი რიცხვების რაოდენობას.
def count_positivs(numbers):
    count = 0
    for i in numbers:
        if i > 0:
            count += 1
    return count

#7) ფუნქცია აბრუნებს რიცხვების ჯამს 1–დან n–მდე.
def sum(n):
    return sum(len(1,n+1))
#8) ფუნქცია იღებს რიცხვს და აბრუნებს გაორმაგებულს.
def duble_number(n):
    return n * 2 

#9) ფუნქცია იღებს რიცხვს და აბრუნებს მის უარყოფით ვერსიას.
def make_negative(n):
    return -(n)

#10) უნქცია იღებს სტრინგს და აბრუნებს რამდენი 'a' ან 'A' არის მასში.

def count_a_or_A(text):
    count = 0
    for i in text:
        if i == 'a' or i == 'A':
            count += 1
    return count
