//დაწერეთ კოდი, რომელიც აიღებს მასივს, მაგალითად: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
//თუ რიცხვი ლუწია, გამოიტანოს true, თუ კენტი - false
let masive=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i = 0; i < masive.length; i++) {
    if (masive[i] % 2 == 0) {
        console.log(true);
    } else {
        console.log(false);
    }
}
//დაწერეთ კოდი, რომელიც აიღებს მასივს, მაგლითად: [5, 12, 7, 20, 3, 8],
//თუ რიცხვი მეტია 10ზე, გამოიტანოს "დიდი", სხვა შემთხვევაში "პატარა"
let masive1 = [5, 12, 7, 20, 3, 8];

for (let i = 0; i < masive1.length; i++) {
    if (masive1[i] > 10) {
        console.log("დიდი");
    } else {
        console.log("პატარა");
    }
}