//დაწერეთ კოდი, რომელიც აიღებს მასივს [1,3,5,7], და დაითვალოს რამდენი კენტი რიცხვია
let kentebi = [1,3,5,7];
let count = 0;

for (let i = 0; i < kentebi.length; i++){
    if (kentebi[i] % 2 == 1){
        count++;
    }
}console.log(count);
//დაწერეთ კოდი, რომელიც აიღებს მასივს [2,5,8,11], თუ რიცხვი ნაკლებია 6-ზე, გამოიტანოს "low", 
//სხვა შემთხვევაში "high"
let num = [2,5,8,11];

for (let i = 0; i < num.length; i++){
    if (num[i] < 6){
        console.log("low");
    } else {
        console.log("high");
    }
}
//დაწერეთ კოდი, რომელიც აიღებს მასივს [4,9,16,25], 
//თითოეული რიცხვიდან გამოიტანოს მისი კვადრატული ფესვი
let nums = [4, 9, 16, 25];

for (let i = 0; i < nums.length; i++) {
  console.log(Math.sqrt(nums[i]));
}
//დაწერეთ კოდი, რომელიც აიღებს მასივს [100,200,300], ყველა ელემენტი გაყოს 10-ზე და გამოიტანოს შედეგი
let num1 = [100,200,300];

for (let i = 0; i < num1.length; i++){
    console.log(num1[i] / 10);
}
//დაწერეთ კოდი, რომელიც აიღებს მასივს [1,2,3,4,5], და გამოიტანოს მხოლოდ ლუწი რიცხვი
let num2 = [1,2,3,4,5];

for (let i = 0; i < num2.length; i++){
    if (num2[i] % 2 == 0){
        console.log(num2[i]);
    }
}