//1)შექმენი პროგრამა, რომელიც prompt()-ით კითხავს მოსწავლის სახელს, 
//შემდეგ კი alert()-ით აჩვენებს მისალმებას. 
//მაგალითი: თუ მოსწავლემ ჩაწერა „ნიკა“, უნდა გამოჩნდეს: მოგესალმებით, ნიკა!
let name = prompt("რა გქვია?");
alert("მოგესალმებით, " + name + "!");
//2) კითხე მოსწავლეს: „რა არის შენი საყვარელი საგანი სკოლაში?“ 
//შემდეგ აჩვენე alert-ით: შენი საყვარელი საგანია მათემატიკა!
let sagani = prompt("რა არის შენი საყვარელი საგანი სკოლაში?");
alert("შენი საყვარელი საგანია " + sagani + "!")
//3) კითხე მოსწავლეს ასაკი prompt()-ით და აჩვენე შედეგი alert-ში.
let age = prompt("რამდენი წლის ხარ?");
alert("შენი ხარ " + age + " წლის");