// შექმენით მანქანის ობიექტი, იყოს მოცემული სიჩქარე, 
//რაც უნდა უდრიდეს 0-ს. ასევე მიუთეთ მანქანის ბრენდი, მოდელი, გამოშვების წელი და ფერი
const car = {
  brand: "bmw",
  model: "M5",
  year: "ar vici",
  color: "შავი",
  speed: 0
};
// ობიექტში ჩაამატეთ რამე ნებისმიერი ორი გასაღები, 
//რაც მანქანის აგებულობას შეეხება (property.newKey <- ეს გამოიყენეთ) 
car.borbali = 4;    
car.doors = 4; 
console.log(car);
// ჩაამატეთ სამი ფუნქცია: აჩქრება: სიჩქარეს + 10; შენელება: სიჩქარეს - 10. 
// თუ სიჩქარე 10ზე ნაკლებია, მაშინ სიჩქარე 0ზე უნდა დავარდეს, არ უნდა იყოს უარყოფითი. 
// მესამე კი იქნება toString ფუნქცია, რომელიც გამოიტანს წინადადებას: 
// "მანქანა {ბრენდი}, {მოდელი}, გამოიშვა {წელი} წელს და არის {ფერი} ფერის."
const car = {
  brand: "bmw",
  model: "M5",
  year: "ar vici",
  color: "შავი",
  speed: 0,
   speedup: function () {
    this.speed += 10;
  },
  speedown: function () {
    this.speed -= 10;
    if (this.speed < 10) {
      this.speed = 0;
    }
  },
};

