#რამდენი მონაცემთა სტრუქტურაა პითონში?
#4 ესენია List Tuple Set Dictionary

#რა განსხვავებაა მათ შორის? (ყველას შორის)
#List არის მონაცემთა სტრუქტურა სადაც ელემენტები ინახება და არის ორდერდ ლისტი ანუ მას აქვს ინდეხსაცია და შეიძლება შევცვალოთ რამე ამოვაგდოთ ან ჩავამატოთ
#Tuple განსხვავება ის არის რომ მისი შეცვლა არ შეიძლება რასაც ჩავწერთ სულ ეგრე დარჩება მაგრამ თაფლიც არის ორდერედ და შეიძლება ჰქონდე გამეორებადი ელემენტები
#Set არის მონაცემთა სტრუქტურა სადაც ელემენტები უნიკალურია და არ აქვს რიგი ანუ ანორდერდ ლისტია და გამეორება არ შეიძლება ელემენტების
#Dictionary ინახავს მონაცემებს key და valueს დახმარებით და მათზე წვდომაც მათი დახმარებით ხდება ძრითადად გამოიყენება აღწერისთვის
#რა არის საკვანძო სიტყვა
#საკვანძო სიტყვა ისეთი სიტყვააა რომლის შცვლაც ჩვენ არ შგვიძლია მაგალითად if else true false return და ასე შმდეგ