#გაიხსენეთ ნასწავლი ოთხივე მონაცემთა სტრუქტურა პითონში
#სათითაოდ ჩამოთვალეთ რომელს რა ახასიათებს
#რა განსხვავება არის მათ შორის
#თითოს რამდენი ფუნქციები გააჩნია და ჩამოთვალეთ ისინი
#დაასახელეთ თქვენთვის ნაცნობი მონაცემთა ტიპები
#რა განსხვავებაა მონაცემთა სტრქუტურასა და მონაცემთა ტიპებს შორის

#list ანუ სია ინახავს ყველაფერს დალაგებულად ანუ არის orderedლისტი მას ვწერთ კვადრატულ ფრჩხილებშ[] 
#ლისტი სხვებისგან განსხვავდება იმით რომ რასაც ჩავწერთ ზუსტად იგივეს ამოაგდებს და მისი შეცვლაც შეგვიძლია
#append() remove() pop() clear() index() count() 

#set არის სია რომელიც ამოეგდებს ყველა გამეორებულ ელემენტს. სეტი არ აქვს ინდექსაცია და მას ვწერთ ასეთ ფრჩიხელბში{}
#სეტი სცვების გან იმით განსხვავდება რომ მას არ აქვს ინდექსაცია და ამოეგდებს ყველა გამეორებულ ელემენტს
#add() update() remove() discard() pop() clear() union()

#tuple არის უნიკალური სია რომელსშიც რასაც ჩავწერთ იმას ვერც ამოვაგდებთ სიიდან და ვერც ჩავამატებთ
# თაპლი სხვებისგან განსხვავდება იმით რომ მასში ვერაფერს ამოვაგდებთ ან ჩავამატებთ
#count() index()

#dictionaryში ვინახავთ ძირითადად რაიმეს აღწერას და მასზე წვდობა ხდება keyს და valueს მეშვეობით 
#dictionary კი სხვებისგან მასზე წვდომის სახით განსხვავდება 
#keys() values() pop() clear()

#მონაცემთა ტიპები რომლებიც ვიცით: integer float string boolean
#მონაცემთა სტრუქტურა როგორც თვითნ სიტყვა გვეუბნება არის რაიმეს სტრუქტურა რომელშიც ვწერთ მონაცემთა ტიპებს ანუ integer float string boolean