//1.ზოგადად რითვის გამოიყენება Javascript?
//ჯავასკრიპტი გამოიყენება ვებსაიტების ინტერაქციულობისთვის და ვებსაიტს უფრო სრულყოფილს ხდის

//2.რამდენი გზა არსებობს ცვლადის შესაქმნელად Javascript-ში?
// 3 გზა var let და const

//3.რა ახასიათებს თითოეულ გზას ცვლადის შესაცვლელად?
// var სა და let შორის განსხვავება ის არის რომ ვარ უფრო მოძველებული ფუნქციაა ლეთ კი თანამედროვე 
// ლეთ სა და const შორის განსხვავებაა ის არის რომ const უცვლელია let კი როცა გვინდა მაშინ შეგვიძლია შეცვლა 

//4.რა მონაცემთა ტიპები გვაქვს Javascript-ში?
// string, number, boolean, null, undifined.