

#ცხრილი არის სტრუქტურა რომელიც მონაცემებს სვეტებისა და სტრიქონების სახით აწყობს.
#  მისი მიზანია ინფორმაციის მკაფიოდ და ორგანიზებულად წარმოდგენა.

#HTML-ში <table> არის ტეგი, რომელსაც webpages-ზე ცხრილის შესაქმნელად ვიყენებთ.
# #ის შეიცავს სხვა ტეგებს, რომლებიც ცხრილის სტრუქტურას ქმნიან (thead, tbody, tr, th, td).

#<thead> არის HTML ელემენტი, რომელიც ცხრილის ზედა ნაწილს — სათაურებს — აერთიანებს.

#<tr> ნიშნავს table row — ცხრილის სტრიქონს ეს ტეგი გამოიყენება იმისთვის რომ ჯგუფად მოვათავსოთ უჯრები (<td> ან <th>) ერთ ხაზზე.

# ეს თეგი გამოხატავს სტრიქონის სახელს


#<tbody> არის ცხრილის ძირითადი ნაწილი. მას სათაურის დაწერის მერე ვწერთ და მასში ბევრი სხვა თეგიც შედიც

#ეს არის ადგილები, სადაც მოთავსებულია მონაცემები (ტექსტი, რიცხვები და ა.შ.).

