#1) რა არის add() ჩაშენებული ფუნქცია?

#add ამატებს ერთ ელემენტს set-ში.
set = {1, 2, 3}
set.add(4)
print(set)  




#2) რა არის union() ჩაშენებული ფუნქცია?
#union აერთიანებს ორ ან მეტ set-ს
my_set = {1, 2, 3}
my_set1= {3, 4, 5}
my_set2 = my_set.union(my_set1)
print(my_set2)




#3) რა არის discard() ჩაშენებული ფუნქცია?
#discard შლის მითითებულ ელემენტს set-დან.
set1={1,2,3}
set1.discard(2)
print(set1)



#4) რა არის remove() ჩაშენებული ფუნქცია?
#removeიც შლის ელემენტს set-დან მაგრამ თუ ელემენტი არ არსებობს გამოაგდებს შეცდომას (KeyError).
myset={1,2,3}
myset.remove(2)
print(myset)



#5) რა არის update() ჩაშენებული ფუნქცია?
#update ამატებს მრავალ ელემენტს ერთდროულად
nums={1}
nums.update([2,3,4,4,6,7,8,9,10])
print(nums)



#6) რა განსხვავება არის discard() - სა და remove() ჩაშენებულ ფუნქციებს შორის?
#თუ დისქარდით იმ რიცხვის ამოვაგდებთ რომელიც სეტში არაა პრობლემა არ იქნება ხოლო რემუვის დროს ამაგდებს key error.
num = {1, 2, 3}
num.discard(10)   # პრობლემა არ არის
num.remove(10)    # KeyError!

