//1)სთხოვეთ მომხმარებელს შეიყვანოს თავისი ასაკი prompt()-ით.
//თუ მომხმარებელი შეიყვანს 18-ზე ნაკლებ რიცხვს, alert()-ით გამოუტანეთ შეტყობინება:
// "წვდომა შეზღუდულია". სხვა შემთხვევაში (18 ან მეტი) გამოუტანეთ: "წვდომა დაშვებულია".
let age = prompt("შეიყვანეთ თქვენი ასაკი:");

if (age < 18) {
  alert("წვდომა შეზღუდულია");
} else {
  alert("წვდომა დაშვებულია");
}
//2) შექმენით პროგრამა, რომელიც ზედიზედ ორჯერ ამოაგდებს prompt() 
//ფანჯარას და მომხმარებელს სთხოვს ორ სხვადასხვა რიცხვს. ბოლოს alert()-ის მეშვეობით აჩვენეთ ამ 
//ორი რიცხვის ჯამი. (გაითვალისწინეთ: prompt-იდან მიღებული მნიშვნელობა ყოველთვის ტექსტია, 
//ამიტომ დაგჭირდებათ მისი რიცხვად გარდაქმნა) 
let num1 = Number(prompt("შეიყვანეთ პირველი რიცხვი:"));
let num2 = Number(prompt("შეიყვანეთ მეორე რიცხვი:"));
let jami = num1 + num2;
alert("ჯამი არის " + jami);
//3) შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს 
//პროდუქტის საწყის ფასს. პირველი prompt()-ით მოითხოვეთ ნივთის ფასი. მეორე prompt()-ით მოითხოვეთ 
//ფასდაკლების პროცენტი (მაგალითად: 20). პროგრამამ უნდა გამოთვალოს საბოლოო ფასი ფორმულით: 
//$ფასი - (ფასი \times პროცენტი / 100)$. alert()-ით გამოიტანეთ შეტყობინება: 
//"თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: [შედეგი] ლარი". 
let price = Number(prompt("შეიყვანეთ პროდუქტის ფასი:"));
let fasdakleba = Number(prompt("შეიყვანეთ ფასდაკლების პროცენტი:"));
let finalPrice = price - (price * fasdakleba / 100);
alert("თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: " + finalPrice + " ლარი");
//4)რა განსხვავებაა prompt ცნებასა და alert ცნებას შორის განმარტეთ თეორიულად რაც მთავარია გაიაზრეთ 
//prompt გამოიყენება მომხმარებლისგან მონაცემის მისაღებად
//alert მხოლოდ შეტყობინების გამოსატანად გამოიყენება
//5)შეგვიძლია თუ არა alert და prompt-ის გაერთიანება თუ კი მომიყვანეთ მაგალითი, თუ არა რატომ? წარმატებები❤️
let name = prompt("ur name");
alert("hi " + name)